# OpenAreaLoadLoopError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LoadFailures..::..OpenAreaLoadLoopError Property
BuiltInFailures..::..LoadFailures Class See Also
---
Area Load Sketch can't contain open loops.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId OpenAreaLoadLoopError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OpenAreaLoadLoopError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ OpenAreaLoadLoopError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..LoadFailures Class
Autodesk.Revit.DB Namespace